<?php

$arr = [
	'Московская область' => [
		explode(', ', 'Красногорск, Зеленоград, Химки, Люберцы, Королёв, Мытищи'),
	],
	'Ленинградская область' => [
		explode(', ', 'Санкт-Петербург, Всеволожск, Павловск, Кронштадт'),
	],
	'Ростовская область' => [
		explode(', ', 'Ростов-на-Дону, Азов, Батайск, Донецк, Шахты, Новочеркасск'),
	],
];

foreach ($arr as $key => $value) {
	echo "<p>$key</p><ul>";
	foreach ($value[0] as $key2 => $value2) {
		if (mb_substr( $value2, 0, 1 ) == 'К') {
			echo "<li>$value2</li>";
		}
	}
	echo "</ul>";
}
